#include <iostream>
#include <cmath>
#include <algorithm>

using namespace std;
int main()
{
    setlocale(LC_ALL, "RUS");
    float a, b, c, s, R, r, p, m, h; 
    float eps = 0.00001;
    cin >> a >> b >> c;
    if (a > b)
        swap(a, b);
    if (b > c)
        swap(b, c);
    if (a > b)
        swap(a, b); //сравнение сторон 
    if ((a + b > c && a + c > b && c + b > a) == 0) //проверка на существование
        cout << "треугольник не существует";
    else
    {
        p = (a + b + c) / 2.0; //полупериметр
        s = sqrt(p * (p - a) * (p - b) * (p - c)); //площадь
        R = a * b * c / 4.0 / s; // радиус описанной окружности
        r = s / p; // радиус вписанной окружности
        cout << "s= " << s << " R= " << R << " r= " << r; 
        if ((abs(a * a - b * b - c * c) < eps) || (abs(b * b - c * c - a * a) < eps) || (abs(c * c - b * b - a * a) < eps)) // если ыфполняется теорема пифагора, то...
        {
            if ((abs(a - b) < eps) || (abs(a - c) < eps) || (abs(c - b) < eps)) // если 2 стороны равны, то равнобедренный и прямоугольный
            {
            m =c / 2.0; // медиана 
            cout << "  ПУТ и равнобедренный " << c << "  - Гипотенуза  " << a << " " << b << " - Катеты  " << m << " - медиана высота   ";
            }
            else // иначе просто прямоугольный
            {
            m = c / 2.0; //
            h = s / c * 2.0;
            cout << "  ПУТ  " << c << "  Гипотенуза  " << a << " "<< b << "  Катеты  " << m << "  медиана  " << h << "  высота  ";
            }
        }
        else if ((abs(a - b) < eps) && (abs(c - b) < eps) && (abs(a - c) < eps)) { // если все стороны равны, то равносторонний 
        h = R + r; // высота
        cout << "    равносторонний   "<< h << " - высота медиана биссектриса";
        }
        else if (((abs(a - b) < eps && abs(c - b) > eps) || (abs(a - c) < eps && abs(a - b) > eps) || (abs(c - b) < eps && abs(a - c) > eps)) && ((abs(b * b - c * c - a * a) > eps) && (abs(c * c - b * b - a * a) > eps))) // если равны 2 стороны, то равнобедренный
        {
            if (abs(a - b) < eps)
        {
            cout << "   равнобедренный " << a << " "  << b << " - ребра " << c << " - основание " << s / c * 2 << " - высота медиана биссектриса";
        }
            if (abs(a - c) < eps)
        {
            cout << "   равнобедренный " << a << " "  << c << " - ребра " << b << " - основание " << s / c * 2 << " - высота медиана биссектриса";
        }
            if (abs(b - c) < eps)
        {
            cout << "   равнобедренный " << b << " " << c << " - ребра " << a << " - основание " << s / c * 2 << " - высота медиана биссектриса";
        }

    }   
        else { // иначе разносторонний
            cout << "    разносторонний";
        }
    return 0;
}
}
